// ================== 1 se 10 tak ginti print karao ====================

// let num = 1;             

// for (num; num <= 10; num++) {  
//   console.log(num);       
// }


// ========== 1 से 100 तक के सभी even numbers (सम संख्या) प्रिंट करें। ====================

// for (let num = 1; num <= 100; num++) {
//   if (num % 2 === 0) {      
//     console.log(num);       
//   }
// }

// ========  1 से 50 तक के सभी odd numbers (विषम संख्या) प्रिंट करें। ===============

for (let num = 1; num <= 100; num++) {
  if (num % 3 === 0) {      
    console.log(num);       
  }
}

// ========== यूज़र से एक नंबर लें और 1 से उस नंबर तक के सभी नंबर प्रिंट करें।  ================







//  ========== एक प्रोग्राम बनाइए जो 1 से 10 तक का sum (योग) निकाले। ================

